Revit 2027 API
GeometryCreationUtilities.CreateExtrusionGeometry Method
Overload List
Name | Description
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double) |  Creates a solid by linearly extruding one or more closed coplanar curve loops.
CreateExtrusionGeometry(IList<CurveLoop>, XYZ, Double, SolidOptions) |  Creates a solid by linearly extruding one or more closed coplanar curve loops.
Top
See Also
Reference
GeometryCreationUtilities Class
Autodesk.Revit.DB Namespace